"""
Title   : やさしく学ぶLLMエージェント
Chapter : 3 エージェント
Section : 5 ペルソナのあるエージェント 
Theme   : ペルソナの重要性
Date    : 2025/07/19
Page    : P128-129
"""


# ＜ペルソナとは＞
# - LLMの性格/価値観/趣味嗜好などのキャラクターをペルソナという
# - ペルソナはLLMをパーソナライズさせるために必要な機能
#   --- プロンプトのシステムメッセージによる設定に似ている


# ＜ペルソナの効果＞
# 1 自然な対話体験の提供
#   LLMの一つの目標は人間に近づけること、それを実現するための方策
#
# 2 コンテキストの持続性と一貫性
#   トーンに一貫性を持たせることで、対話の一貫性を維持しやすくなる
#
# 3 特定ニーズや専門性への適応
#   専門分野に応じたペルソナを設定することで専門性向上が期待できる
#   （保証されるわけではない）
#
# 4 ユーザーエンゲージメントの向上
#   親しみやすい対話をすることで、ユーザーとの結びつきを強める